AUTO_config_TK_pesok/src/Documents/Антимонопольный/Антимонопольный.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>Антимонопольный</name>
  <attributes>
    <name>Организация</name>
    <comment>(Общ)</comment>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ПодразделениеКомпании</name>
    <comment>Подразделение компании в котором был выписан документ</comment>
    <type>
      <types>CatalogRef.ПодразделенияКомпании</types>
    </type>
  </attributes>
  <attributes>
    <name>ХозОперация</name>
    <comment>Выполняемая документом операция</comment>
    <type>
      <types>CatalogRef.ХозОперации</types>
    </type>
  </attributes>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <comment>(Общ) Любая дополнительная информация</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачала</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончания</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>АкцизнаяГруппа</name>
    <type>
      <types>CatalogRef.ГруппыАкциза</types>
    </type>
  </attributes>
  <attributes>
    <name>ЕдиницаОтчета</name>
    <type>
      <types>CatalogRef.КлассификаторЕдиницИзмерения</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ТаблицаОтчета1</name>
    <attributes>
      <name>Дата</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КодТеретории</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Контрагент</name>
      <type>
        <types>CatalogRef.Контрагенты</types>
      </type>
    </attributes>
    <attributes>
      <name>ЮрАдрес</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ОКПО</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КодАМ</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>8</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоПриход</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>20</precision>
          <scale>6</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ТаблицаОтчета2</name>
    <attributes>
      <name>Дата</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КодТеретории</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Контрагент</name>
      <type>
        <types>CatalogRef.Контрагенты</types>
      </type>
    </attributes>
    <attributes>
      <name>ЮрАдрес</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ОКПО</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КодАМ</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>8</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоРасход</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>20</precision>
          <scale>6</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ТаблицаОтчета3</name>
    <attributes>
      <name>КодАМ</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>8</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ОстатокНаНачало</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>6</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПриходВсего</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>6</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПриходПроизводитель</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>6</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПриходОпт</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>6</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПриходИмпорт</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>6</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>РасходВсего</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>6</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>РасходРозница</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>6</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>РасходОпт</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>6</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>РасходЭкспорт</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>6</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ОстатокНаКонец</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>6</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоРасходПоОтчету</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>6</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаРасходПоОтчету</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>6</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоРасход</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>6</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаРасход</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>20</precision>
          <scale>6</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

AUTO_config_TK_pesok/src/Catalogs/Контрагенты/Контрагенты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Контрагенты</name>
  <predefined>
    <items>
      <name>ОсновнойКонтрагент</name>
      <description>Основной контрагент</description>
    </items>
    <items>
      <name>ЧастноеЛицо</name>
      <description>Частное лицо</description>
    </items>
  </predefined>
  <attributes>
    <name>НаименованиеПолное</name>
    <comment>Полное наименование контрагента</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВидКонтрагента</name>
    <comment>Вид контрагента</comment>
    <type>
      <types>EnumRef.ВидыКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>ЮрФизЛицо</name>
    <type>
      <types>EnumRef.ЮрФизЛицо</types>
    </type>
  </attributes>
  <attributes>
    <name>ЮридическоеФизическоеЛицо</name>
    <comment>Реквизит введен для совместимости с Библиотекой типов и не выводится в пользовательский интерфейс. Заполняется автоматически по данным реквзита ЮрФизЛицо.</comment>
    <type>
      <types>EnumRef.ЮридическоеФизическоеЛицо</types>
    </type>
  </attributes>
  <attributes>
    <name>ПлательщикНДС</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РегистрационныйНомер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КодПоЕДРПОУ</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерСвидетельстваПлательщикаНДС</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>15</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИННПлательщикаНДС</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>12</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КодФилиала</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>15</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>GLN</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>13</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаРегистрации</name>
    <comment>Используется при анализе первичного интереса</comment>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДополнительнаяИнформация</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <comment>Дополнительная информация о контрагенте</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>КодWERA</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ФормаРаботы</name>
    <comment>1 - Корректировка 2 - Замена накладных</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НеИспользоватьПротоколыЦен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОсновнойБанковскийСчетКонтрагента</name>
    <type>
      <types>CatalogRef.БанковскиеСчетаКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроизводительИмпортерТабак</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>КонтактнаяИнформация</name>
    <attributes>
      <name>Тип</name>
      <comment>Тип</comment>
      <type>
        <types>EnumRef.ТипыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Вид</name>
      <comment>Вид</comment>
      <type>
        <types>CatalogRef.ВидыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Представление</name>
      <comment>Представление</comment>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗначенияПолей</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Страна</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Регион</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Город</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>АдресЭП</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДоменноеИмяСервера</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефона</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефонаБезКодов</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВидДляСписка</name>
      <type>
        <types>CatalogRef.ВидыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <comment>Свойство</comment>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <comment>Значение</comment>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

AUTO_config_TK_pesok/src/Documents/Антимонопольный/Forms/ФормаДокумента/Module.bsl
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Элементы.ХозОперация.СписокВыбора.ЗагрузитьЗначения(ЗначениеНастроекПовтИсп.ПолучитьХозОперацииДокумента("Антимонопольный"));

КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПриходыНаСервере()
	
	ДанныеДокумента = Новый Структура;
	ДанныеДокумента.Вставить("Организация",		   	   			Объект.Организация);
	ДанныеДокумента.Вставить("ДатаНачала",		   	 			Объект.ДатаНачала);
	ДанныеДокумента.Вставить("ДатаОкончания",		   			КонецДня(Объект.ДатаОкончания));
	ДанныеДокумента.Вставить("АкцизнаяГруппа",		   			Объект.АкцизнаяГруппа);
	ДанныеДокумента.Вставить("ЕдИзмеренияПоКлассификатору",		Объект.ЕдиницаОтчета);

	Документы.Антимонопольный.ЗполнитьДанныеПоПриходам(ДанныеДокумента,Объект.ТаблицаОтчета1);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПриходы(Команда)
	ЗаполнитьПриходыНаСервере();
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьРасходыНаСервере()
	
	ДанныеДокумента = Новый Структура;
	ДанныеДокумента.Вставить("Организация",		   	   Объект.Организация);
	ДанныеДокумента.Вставить("ДатаНачала",		   	   Объект.ДатаНачала);
	ДанныеДокумента.Вставить("ДатаОкончания",		   КонецДня(Объект.ДатаОкончания));
	ДанныеДокумента.Вставить("АкцизнаяГруппа",		   Объект.АкцизнаяГруппа);
	ДанныеДокумента.Вставить("ЕдИзмеренияПоКлассификатору",		Объект.ЕдиницаОтчета);
	
	Документы.Антимонопольный.ЗполнитьДанныеПоРасходам(ДанныеДокумента,Объект.ТаблицаОтчета2);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьРасходы(Команда)
	ЗаполнитьРасходыНаСервере();
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьИтоговуюНаСервере()
	ТаблицаПриходов     =   Объект.ТаблицаОтчета1.Выгрузить(,"КодАМ,КоличествоПриход");
	ТаблицаПриходов.Свернуть("КодАМ","КоличествоПриход");
	
	
	Объект.ТаблицаОтчета3.Очистить();
	ТаблицаИтог = Объект.ТаблицаОтчета3.Выгрузить();
	
	ДанныеДокумента = Новый Структура;
	ДанныеДокумента.Вставить("Организация",		   	   Объект.Организация);
	ДанныеДокумента.Вставить("ДатаНачала",		   	   Объект.ДатаНачала);
	ДанныеДокумента.Вставить("ДатаОкончания",		   КонецДня(Объект.ДатаОкончания));
	ДанныеДокумента.Вставить("АкцизнаяГруппа",		   Объект.АкцизнаяГруппа);
	ДанныеДокумента.Вставить("ЕдИзмеренияПоКлассификатору",		Объект.ЕдиницаОтчета);
	
	Документы.Антимонопольный.ЗполнитьДанныеПоРознице(ДанныеДокумента,ТаблицаИтог);
	
	
	Для Каждого Стр Из ТаблицаПриходов Цикл 
		НоваяСтрока = ТаблицаИтог.Добавить();
		НоваяСтрока.КодАМ = СокрЛП(Стр.КодАМ);
		НоваяСтрока.ПриходОпт = Стр.КоличествоПриход;
	КонецЦикла;
	ТаблицаРасходов =    Объект.ТаблицаОтчета2.Выгрузить(,"КодАМ,КоличествоРасход");
	ТаблицаРасходов.Свернуть("КодАМ","КоличествоРасход");
	Для Каждого Стр Из ТаблицаРасходов Цикл 
		НоваяСтрока = ТаблицаИтог.Добавить();
		НоваяСтрока.КодАМ = СокрЛП(Стр.КодАМ);
		НоваяСтрока.РасходОпт = Стр.КоличествоРасход;
	КонецЦикла;
	ТаблицаИтог.Свернуть("КодАМ","ОстатокНаНачало,ПриходВсего,ПриходПроизводитель,ПриходОпт,ПриходИмпорт,РасходВсего,РасходРозница,РасходОпт,РасходЭкспорт,ОстатокНаКонец,КоличествоРасходПоОтчету,СуммаРасходПоОтчету,КоличествоРасход,СуммаРасход");
	
	Для Каждого Стр Из ТаблицаИтог Цикл 
		Стр.ПриходВсего = Стр.ПриходПроизводитель + Стр.ПриходОпт + Стр.ПриходИмпорт;
		Стр.РасходВсего = Стр.РасходРозница + Стр.РасходОпт + Стр.РасходЭкспорт;
		Стр.ОстатокНаКонец = Стр.ОстатокНаНачало - Стр.РасходВсего + Стр.ПриходВсего;
		
	КонецЦикла;
	
	
	Объект.ТаблицаОтчета3.Загрузить(ТаблицаИтог);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьИтоговую(Команда)
	ЗаполнитьИтоговуюНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаОтчета3КоличествоРасходПоОтчетуПриИзменении(Элемент)
	ТекущаяСтрока = Элементы.ТаблицаОтчета3.ТекущиеДанные;
	ОбработкаРеквизита("ТаблицаОтчета3.КоличествоРасходПоОтчету",ТекущаяСтрока);
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаОтчета3СуммаРасходПоОтчетуПриИзменении(Элемент)
	ТекущаяСтрока = Элементы.ТаблицаОтчета3.ТекущиеДанные;
	ОбработкаРеквизита("ТаблицаОтчета3.СуммаРасходПоОтчету",ТекущаяСтрока);
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаОтчета3ОстатокНаНачалоПриИзменении(Элемент)
	ТекущаяСтрока = Элементы.ТаблицаОтчета3.ТекущиеДанные;
	ОбработкаРеквизита("ТаблицаОтчета3.ОстатокНаКонец",ТекущаяСтрока);
КонецПроцедуры





&НаКлиенте
Функция ОбработкаРеквизита(Имя,ТекСтрока) 
	Если Имя = "ТаблицаОтчета3.КоличествоРасходПоОтчету" Тогда
		ЦенаЗаЕд =  ?(ТекСтрока.КоличествоРасход = 0 ,0,ТекСтрока.СуммаРасход  / ТекСтрока.КоличествоРасход);
		ТекСтрока.СуммаРасходПоОтчету =   ЦенаЗаЕд * ТекСтрока.КоличествоРасходПоОтчету;
		ОбработкаРеквизита("ТаблицаОтчета3.СуммаРасходПоОтчету",ТекСтрока);
		ОбработкаРеквизита("ТаблицаОтчета3.РасходРозница",ТекСтрока);

	ИначеЕсли Имя = "ТаблицаОтчета3.СуммаРасходПоОтчету" Тогда
		КолВоГрн =  ?(ТекСтрока.СуммаРасход = 0 ,0,ТекСтрока.КоличествоРасход/ ТекСтрока.СуммаРасход);
		ТекСтрока.КоличествоРасходПоОтчету =   КолВоГрн * ТекСтрока.СуммаРасходПоОтчету;
		ТекСтрока.РасходРозница = ТекСтрока.КоличествоРасходПоОтчету;
		ОбработкаРеквизита("ТаблицаОтчета3.РасходРозница",ТекСтрока);
		
	ИначеЕсли Имя = "ТаблицаОтчета3.РасходРозница" Тогда
		ТекСтрока.РасходВсего = ТекСтрока.РасходРозница + ТекСтрока.РасходОпт + ТекСтрока.РасходЭкспорт;
		ОбработкаРеквизита("ТаблицаОтчета3.ОстатокНаКонец",ТекСтрока);
		
	ИначеЕсли Имя = "ТаблицаОтчета3.ОстатокНаКонец" Тогда
		ТекСтрока.ОстатокНаКонец = ТекСтрока.ОстатокНаНачало + ТекСтрока.ПриходВсего -  ТекСтрока.РасходВсего;
	Иначе
		Возврат Ложь;
	КонецЕсли;
	
КонецФункции


&НаСервере
Функция НайтиКодТеритории(Контрагент)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ДополнительныеСведения.Значение КАК КодТеритории
		|ИЗ
		|	РегистрСведений.ДополнительныеСведения КАК ДополнительныеСведения
		|ГДЕ
		|	ДополнительныеСведения.Объект ССЫЛКА Справочник.Контрагенты
		|	И ДополнительныеСведения.Свойство.Имя = ""КодТеритории""
		|	И ДополнительныеСведения.Объект = &Объект";
	
	Запрос.УстановитьПараметр("Объект", Контрагент);
	
	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если РезультатЗапроса.Пустой() Тогда 
		Возврат "";
	Иначе
		ВыборкаДетальныеЗаписи.Следующий();
		Возврат ВыборкаДетальныеЗаписи.КодТеритории;
	КонецЕсли;
	
КонецФункции


&НаКлиенте
Процедура ТаблицаОтчета1КонтрагентПриИзменении(Элемент)
	ТекДанные = Элементы.ТаблицаОтчета1.ТекущиеДанные;
	ТекДанные.КодТеретории = НайтиКодТеритории(ТекДанные.Контрагент);
КонецПроцедуры


&НаКлиенте
Процедура ТаблицаОтчета2КодТереторииПриИзменении(Элемент)
КонецПроцедуры


&НаКлиенте
Процедура ТаблицаОтчета2КонтрагентПриИзменении(Элемент)
	ТекДанные = Элементы.ТаблицаОтчета2.ТекущиеДанные;
	ТекДанные.КодТеретории = НайтиКодТеритории(ТекДанные.Контрагент);
КонецПроцедуры
